-- -----------------------------------------------------------------------------
-- | WonderTek [ 网络无处不在，沟通及时到达 ]
-- -----------------------------------------------------------------------------
-- | Copyright (c) 2012, WonderTek, Inc. All Rights Reserved.
-- -----------------------------------------------------------------------------
-- | Author: xxxx <xxxx@xxxx.com>
-- -----------------------------------------------------------------------------
-- | Desc: 季度模版数据源
-- -----------------------------------------------------------------------------
jdtitleItems = {
    {'1', "jdsubItems1", "室外高低压线路和配电设备",
        {
        {"1","室外高低压线路","1","安全,不安全","1,0",""},
        {"2","自建变压器设备","1","正常,不正常","1,0"},
        {"3","室外配电箱检查","1","安全,不安全","1,0"},
        {"4","开关及连接线缆","1","安全,不安全","1,0"},
        {"5","熔断器（个）","2","0,100",""},
        {"6","熔断器及温升（℃）","2","0,100",""},
        {"7","指示信号告警","1","安全,不安全","1,0"},
        {"8","市电检查A相电压(V)","2","0,100",""},
        {"9","市电检查B相电压(V)","2","0,100",""},
        {"10","市电检查C相电压(V)","2","0,100",""},
        {"11","市电检查A相电流(A)","2","0,100",""},
        {"12","市电检查B相电流(A)","2","0,100",""},
        {"13","市电检查C相电流(A)","2","0,100",""},
        {"14","机架内有负载设备的标签是否完整","1","完整,不完整","1,0"}
    }},
    {'2', "jdsubItems2", "开关电源",
        {
        {"1","关电源品牌","1","易达,中达,艾默生,华为,无","1,1,1,1,0",},
        {"2","关电源工作状态","1","正常,不正常","1,0",},
        {"3","关电源浮充电压","2","0,100","",},
        {"4","关电源均充电压","2","0,100","",},
        {"5","查告警指示状态","1","正常,不正常","1,0",},
        {"6","查面板显示功能","1","正常,不正常","1,0",},
        {"7","查风扇是否正常","1","正常,不正常","1,0",},
        {"8","个模块容量(A)","2","0,100","",},
        {"9","块应配备数（个）","2","0,100","",},
        {"10","块实配数（个）","2","0,100","",},
        {"11","量输出电压(V)","2","0,100","",},
        {"12","量输出电流(A)","2","0,100","",},
        {"13","关电源设备是否清洁","1","是,否","1,0",},
        {"14","查标签","1","有,无","1,0",},
        {"15","查防雷保护","1","正常,不正常","1,0",},
        {"16","线端子接触是否良好","1","是,否","1,0",},
        {"17","查开关和接触器件接触是否良好","1","是,否","1,0",}
    }},
    {'3', "jdsubItems3", "蓄电池",
        {
        {"1","蓄电池品牌","1","易达,光宇,复华,华达,艾默生,双登,风帆,无,其它","1,1,1,1,1,1,1,0,1",},
        {"2","电池组连接条检查","1","正常,不正常","1,0",},
        {"3","电池正负极连接头","1","正常,不正常","1,0",},
        {"4","第1组蓄电池组电压(V)","2","0,100","",},
        {"5","第2组蓄电池组电压(V)","2","0,100","",}
    }},
    {'4', "jdsubItems4", "防雷接地",
        {
        {"1","避雷器品牌","1","中达,深圳盾牌,西子,普天,艾默生,亚西,无,其它 ","1,1,1,1,1,1,0,1",},
        {"2","防雷器工作状态读数（次）","2","0,100","",},
        {"3","防雷接地规范性","1","正常,不正常","1,0",},
        {"4","接地端子检查","1","正常,不正常","1,0",}
    }},
    {'5', "jdsubItems5", "空调和新风设备",
        {
        {"1","空调设备品牌","1","力博特,阿尔西,海尔,RC,海信,美的,艾默生,格力,无,其它","1,1,1,1,1,1,1,1,0,1",},
        {"2","检查并清洁空调室内机部分","1","有,无","1,0",},
        {"3","检查并清洁空调机室外部分","1","有,无","1,0",},
        {"4","空调室内机设置温度（℃）","2","0,100","",},
        {"5","空调进风口温度（℃）","2","0,100","",},
        {"6","空调出风口温度（℃）","2","0,100","",},
        {"7","空调进出温差（℃）","2","0,100","",},
        {"8","检查空调机冷媒管和排水管","1","正常,不正常","1,0",},
        {"9","来电自启动功能检查","1","正常,不正常","1,0",},
        {"10","远程开关机功能检查","1","正常,不正常","1,0",},
        {"11","空调智能控制器检查","1","正常,不正常","1,0",},
        {"12","新风设备工作状态检查","1","正常,不正常","1,0",},
        {"13","新风设备自启动和关闭性能检查","1","正常,不正常","1,0",},
        {"14","新风设备及滤网清洁","1","正常,不正常","1,0",}}},
    {"6","jdsubItem6","基站动力环境监控设备",
    {
        {"1", "动力环境监控设备", "1" ,"佳讯,高新兴,无,其它", "1,1,1,1"},
        {"2", "工作状态外表清洁", "1" ,"是,否", "1,0"},
        {"3", "交流电压低门限（V）", "2" ,"0,100", ""},
        {"4", "直流电压低门限（V）", "2" ,"0,100", ""},
        {"5", "温度高门限（℃）", "2" ,"0,100", ""},
        {"6", "连接紧固检查", "1" ,"正常,不正常 ", "1,0"},
        {"7","检查门禁和告警", "1" ,"正常,不正常 ", "1,0"},
        {"8", "模拟告警测试", "1" ,"正常,不正常 ", "1,0"}
    }},
    {"7","jdsubItem7","基站主设备",{
        {"1", "设备运行状况和告警", "1" ,"正常,不正常", "1,0"},
        {"2", "设备所有连线标签", "1" ,"正常,不正常", "1,0"},
        {"3", "内部和外部接地", "1" ,"正常,不正常", "1,0"},
        {"4", "板件安装情况", "1" ,"正常,不正常", "1,0"},
        {"5", "基站主设备清洁", "1" ,"有,无", "1,0"}
    }},
    {"8","jdsubItem8","基站传输设备",{
        {"1", "设施除尘线缆整理", "1" ,"有,无", "1,0"},
        {"2", "接入架各设备单元运行", "1" ,"正常,不正常", "1,0"},
        {"3", "传输设备电源工作", "1" ,"正常,不正常", "1,0"},
        {"4", "微波室内单元电平值", "1" ,"正常,不正常", "1,0"},
        {"5", "检查机架内部接地", "1" ,"有,无", "1,0"}
    }},
    {"9","jdsubItem9","基站铁塔天馈线及接地系统",{
        {"1", "馈线室外三点接地", "1" ,"正常,不正常", "1,0"},
        {"2", "铁塔基础检查", "1" ,"正常,不正常", "1,0"},
        {"3", "铁塔上无关附挂物", "1" ,"正常,不正常", "1,0"},
        {"4", "馈线卡的连接情况", "1" ,"正常,不正常", "1,0"},
        {"5", "天线方位角（°/°/°）", "3" ,"0,100", ""},
        {"6", "天线俯仰角（°/°/°）", "3" ,"0,100", ""},
        {"7", "天线抱杆垂直度", "1" ,"正常,不正常", "1,0"},
        {"8", "天线周围环境", "1" ,"正常,不正常", "1,0"},
        {"9", "铁塔防雷系统", "1" ,"正常,不正常", "1,0"}
    }},
    {"10","jdsubItem10","机房环境",{
        {"1", "检查基站内外环境", "1" ,"正常,不正常", "1,0"},
        {"2", "基站房屋渗漏密封", "1" ,"正常,不正常", "1,0"},
        {"3", "检查基站封堵状况", "1" ,"正常,不正常", "1,0"},
        {"4", "基站人员进出记录", "1" ,"正常,不正常", "1,0"},
        {"5", "机房设施摆放", "1" ,"正常,不正常", "1,0"},
        {"6", "检查照明和插座", "1" ,"正常,不正常", "1,0"},
        {"7", "机房温（℃）", "2" ,"0,100", ""},
        {"8", "机湿度（％）", "2" ,"0,100", ""}
    }}
}
